In [ ]:
import tensorflow as tf
from tensorflow import keras
from tensorflow.keras import Sequential
from tensorflow.keras.layers import Flatten,Dense

In [ ]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split

In [ ]:
data = pd.read_csv(r"/content/Bank_churn_modelling.csv")

In [ ]:
data.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [ ]:
x = data.drop(labels=["RowNumber",	"CustomerId",	"Surname"],axis=1)
y = data['Exited']

In [ ]:
x.head()

   CreditScore Geography  Gender  ...  IsActiveMember  EstimatedSalary  Exited
0          619    France  Female  ...               1        101348.88       1
1          608     Spain  Female  ...               1        112542.58       0
2          502    France  Female  ...               0        113931.57       1
3          699    France  Female  ...               0         93826.63       0
4          850     Spain  Female  ...               1         79084.10       0

[5 rows x 11 columns]

In [ ]:
from sklearn import preprocessing

In [ ]:
label = preprocessing.LabelEncoder()

In [ ]:
x['Gender'] = label.fit_transform(x['Gender'])

In [ ]:
x.head(10)

   CreditScore Geography  Gender  ...  IsActiveMember  EstimatedSalary  Exited
0          619    France       0  ...               1        101348.88       1
1          608     Spain       0  ...               1        112542.58       0
2          502    France       0  ...               0        113931.57       1
3          699    France       0  ...               0         93826.63       0
4          850     Spain       0  ...               1         79084.10       0
5          645     Spain       1  ...               0        149756.71       1
6          822    France       1  ...               1         10062.80       0
7          376   Germany       0  ...               0        119346.88       1
8          501    France       1  ...               1         74940.50       0
9          684    France       1  ...               1         71725.73       0

[10 rows x 11 columns]

In [ ]:
x['Geography'] = label.fit_transform(x['Geography'])

In [ ]:
x.head()

   CreditScore  Geography  Gender  ...  IsActiveMember  EstimatedSalary  Exited
0          619          0       0  ...               1        101348.88       1
1          608          2       0  ...               1        112542.58       0
2          502          0       0  ...               0        113931.57       1
3          699          0       0  ...               0         93826.63       0
4          850          2       0  ...               1         79084.10       0

[5 rows x 11 columns]

In [ ]:
x = pd.get_dummies(x,columns=["Geography"])

In [ ]:
x.head()

   CreditScore  Gender  Age  ...  Geography_0  Geography_1  Geography_2
0          619       0   42  ...            1            0            0
1          608       0   41  ...            0            0            1
2          502       0   42  ...            1            0            0
3          699       0   39  ...            1            0            0
4          850       0   43  ...            0            0            1

[5 rows x 13 columns]

In [ ]:
x_train,x_test,y_train,y_test = train_test_split(x,y)

In [ ]:
np.shape(x)

(10000, 13)

In [ ]:
np.shape(x_test)

(2500, 13)

In [ ]:
from sklearn.preprocessing import StandardScaler

In [ ]:
scalar = StandardScaler()
x_train = scalar.fit_transform(x_train)
x_test = scalar.transform(x_test)

In [ ]:
x_test

array([[ 0.81870485,  0.91875521,  0.27844122, ..., -1.00668904,
        -0.58248237,  1.76340269],
       [ 1.34427225,  0.91875521, -0.5681706 , ...,  0.99335541,
        -0.58248237, -0.56708545],
       [-0.39731384, -1.0884292 , -1.22664646, ..., -1.00668904,
        -0.58248237,  1.76340269],
       ...,
       [-1.03623892,  0.91875521, -0.66223858, ...,  0.99335541,
        -0.58248237, -0.56708545],
       [ 0.0664221 ,  0.91875521, -0.0978307 , ...,  0.99335541,
        -0.58248237, -0.56708545],
       [-0.62402919, -1.0884292 , -0.47410262, ..., -1.00668904,
        -0.58248237,  1.76340269]])

In [ ]:
model = Sequential()
model.add(Dense(x.shape[1],'relu',input_dim = x.shape[1]))
model.add(Dense(128,'relu'))
model.add(Dense(1,'sigmoid'))
model.compile('adam',loss = 'binary_crossentropy',metrics=['Accuracy'])

In [ ]:
model.fit(x_train,y_train,batch_size=10,epochs=10)

Epoch 1/10
750/750 [==============================] - 1s 1ms/step - loss: 0.0800 - accuracy: 0.0000e+00
Epoch 2/10
750/750 [==============================] - 1s 1ms/step - loss: 4.8671e-04 - accuracy: 0.0000e+00
Epoch 3/10
750/750 [==============================] - 1s 1ms/step - loss: 1.2452e-04 - accuracy: 4.0000e-04
Epoch 4/10
750/750 [==============================] - 1s 1ms/step - loss: 5.2031e-05 - accuracy: 0.0017
Epoch 5/10
750/750 [==============================] - 1s 1ms/step - loss: 2.5980e-05 - accuracy: 0.0056
Epoch 6/10
750/750 [==============================] - 1s 1ms/step - loss: 1.4239e-05 - accuracy: 0.0097
Epoch 7/10
750/750 [==============================] - 1s 1ms/step - loss: 8.2662e-06 - accuracy: 0.0155
Epoch 8/10
750/750 [==============================] - 1s 1ms/step - loss: 4.9532e-06 - accuracy: 0.0229
Epoch 9/10
750/750 [==============================] - 1s 1ms/step - loss: 3.0443e-06 - accuracy: 0.0361
Epoch 10/10
750/750 [==============================] - 1s 1ms/step - loss: 1.9046e-06 - accuracy: 0.0476

In [ ]:
y_pred = model.predict_classes(x_test)

WARNING:tensorflow:From <ipython-input-51-bae1a118294d>:1: Sequential.predict_classes (from tensorflow.python.keras.engine.sequential) is deprecated and will be removed after 2021-01-01.
Instructions for updating:
Please use instead:* `np.argmax(model.predict(x), axis=-1)`,   if your model does multi-class classification   (e.g. if it uses a `softmax` last-layer activation).* `(model.predict(x) > 0.5).astype("int32")`,   if your model does binary classification   (e.g. if it uses a `sigmoid` last-layer activation).

In [ ]:
from sklearn.metrics import confusion_matrix,accuracy_score

In [ ]:
confusion_matrix(y_test,y_pred)

array([[2013,    0],
       [   0,  487]])

In [ ]:
accuracy_score(y_test,y_pred)

1.0